doc/html/elements/time.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Time Element</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="title" content="Time Element"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2014-11-12 19:50:44 CST"/>
<meta name="author" content="Jesse Gumm (@jessegumm)"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
<LINK href='../stylesheet.css' rel='stylesheet' type='text/css' />

</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">Time Element</h1>

<p><a href="http://nitrogenproject.com">Home</a> | <a href="../index.html">Getting Started</a> | <a href="../api.html">API</a> | <a href="../elements.html"><b>Elements</b></a> | <a href="../actions.html">Actions</a> | <a href="../validators.html">Validators</a> | <a href="../handlers.html">Handlers</a> | <a href="../config.html">Configuration Options</a> | <a href="../advanced.html">Advanced Guides</a> | <a href="../troubleshooting.html">Troubleshooting</a> | <a href="../about.html">About</a>
</p>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 Time Element - #time {}</a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Time Element - #time {}</h2>
<div class="outline-text-2" id="text-1">


<p>
  Produces the HTML5 Time element. The time element serves as a content wrapper
  for any dates or times you might need to use and can be intelligently handled
  by the browser.
</p>

</div>

<div id="outline-container-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3"></span> Usage</h3>
<div class="outline-text-3" id="text-1-1">





<pre class="src src-erlang">#<span class="org-type">time</span>{text=<span class="org-string">"2013-06-13 16:00Z"</span>, text=<span class="org-string">"June 6th at 4:00GMT"</span>}
</pre>



<pre class="src src-erlang">#<span class="org-type">article</span>{body=[
   #<span class="org-type">h1</span>{text=<span class="org-string">"My Favorite Fruit"</span>},
   <span class="org-string">"Apples, Oranges, and Bananas are my favorite"</span>,
   #<span class="org-type">html5_footer</span>{body=[
      <span class="org-string">"Published "</span>,
      #<span class="org-type">time</span>{text=<span class="org-string">"Last Week"</span>, datetime=<span class="org-string">"2013-08-20"</span>},
      #<span class="org-type">br</span>{},
      <span class="org-string">"Last Modifed "</span>,
      #<span class="org-type">time</span>{text=<span class="org-string">"Yesterday"</span>, datetime=<span class="org-string">"2013-08-27"</span>}
   ]}
]}
</pre>


</div>

</div>

<div id="outline-container-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3"></span> Attributes</h3>
<div class="outline-text-3" id="text-1-2">


<dl>
<dt>datetime - (<i>String</i>)</dt><dd>Date/Time data. Can be a string formatted any
      number of ways: <code>2007-01-01</code>, or a year <code>2013</code>, or just a day and month
      <code>01-11</code> (January 11th any year), or time in 24-hour format (<code>9:00</code>), or time
      with timezone information (<code>09:00Z</code> for GMT or <code>09:00-5:00</code> to indicate 5
      hours behind GMT). Please see the "About the Time Element" in "See Also"
      below for more options. Note, that if this attribute is not set, then the
      contents of text and/or body will be used as the semantic meaning for the
      date time, and interpreted literally.

</dd>
<dt>text - (<i>String</i>)</dt><dd>The text of the time element. Could be a date, time,
      or textual representation (like last week, last year, coming soon, whatever.
      Note, that if the <code>datetime</code> attribute is not set, then the datetime used
      will be the contents of <code>text</code> and/or <code>body</code>.

</dd>
<dt>html_encode (<i>boolean or whites or function arity 1</i>)</dt><dd>Whether or not
      to safely encode the text attribute to HTML, and by what manner.
      (Default: <code>true</code>)

</dd>
<dt>body - (<i>Nitrogen Elements</i>)</dt><dd>The body of the time element.

</dd>
<dt>role - (<i>String</i>)</dt><dd>The role of the HTML5 Time element.
</dd>
</dl>


</div>

</div>

<div id="outline-container-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3"></span> Other Information</h3>
<div class="outline-text-3" id="text-1-3">


<p>
   If you need to do date-time conversion, including dealing with timezones, we
   recommend the use of <a href="https://github.com/choptastic/qdate">qdate</a>, the
   Erlang date and timezone utility. Eventually, <code>qdate</code> will likely become a
   dependency for Nitrogen to integrate its functionality into the <code>#time</code>
   element, but for now, you'll have to work with the <code>#time</code> element's more
   rudimentary form.
</p>
</div>

</div>

<div id="outline-container-1-4" class="outline-3">
<h3 id="sec-1-4"><span class="section-number-3"></span> See Also</h3>
<div class="outline-text-3" id="text-1-4">


<ul>
<li><a href="./base.html">Base element</a>

</li>
<li><a href="http://www.brucelawson.co.uk/2012/best-of-time/">About the HTML Time Element</a>

</li>
<li><a href="https://github.com/choptastic/qdate">Erlang Date and Timezone handling with qdate</a>
</li>
</ul>

</div>
</div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2014-11-12 19:50:44 CST</p>
<p class="author">Author: Jesse Gumm (@jessegumm)</p>
<p class="creator">Org version 7.8.02 with Emacs version 23</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div><h2>Comments</h2>
<b>Note:</b><!-- Disqus does not currently support Erlang for its syntax highlighting, so t-->To specify <!--Erlang--> code blocks, just use the generic code block syntax: <pre><b>&lt;pre&gt;&lt;code&gt;your code here&lt;/code&gt;&lt;/pre&gt;</b></pre>
<br />
<br />
<div id="disqus_thread"></div>
<script type="text/javascript">
	/* * * CONFIGURATION VARIABLES: EDIT BEFORE PASTING INTO YOUR WEBPAGE * * */
	var disqus_shortname = 'nitrogenproject'; // required: replace example with your forum shortname
	var disqus_identifier = 'html/elements/time.html'; //This will be replaced with the path part of the url

	/* * * DON'T EDIT BELOW THIS LINE * * */
	(function() {
		var dsq = document.createElement('script'); dsq.type = 'text/javascript'; dsq.async = true;
		dsq.src = 'http://' + disqus_shortname + '.disqus.com/embed.js';
		(document.getElementsByTagName('head')[0] || document.getElementsByTagName('body')[0]).appendChild(dsq);
	})();
</script>
<noscript>Please enable JavaScript to view the <a href="http://disqus.com/?ref_noscript">comments powered by Disqus.</a></noscript>
<a href="http://disqus.com" class="dsq-brlink">comments powered by <span class="logo-disqus">Disqus</span></a>
</body>
</html>
